# TODO здесь писать код
class Parent:
    name = ''
    age = 0
    list_of_chld = []


class Children:
    name = ''
    age = 0
    status_relax = 0
    status_hunger = 0


pass
'''
Задача 3. Отцы, матери и дети
Что нужно сделать
Реализуйте два класса: «Родитель» и «Ребёнок». 

У родителя есть:
имя,
возраст,
список детей.

И он может:
сообщить информацию о себе,
успокоить ребёнка,
покормить ребёнка.

У ребёнка есть:
имя,
возраст (должен быть меньше возраста родителя хотя бы на 16 лет),
состояние спокойствия,
состояние голода.

Реализация состояний — на ваше усмотрение. Это может быть и простой «флаг», и словарь состояний, 
и что-то поинтереснее.
'''