# TODO здесь писать код

path = '/Users/ei/desktop/linux/python_basic/module22/module14'

pass


'''
Задача 4. Файлы и папки
Что нужно сделать
Напишите программу, которая получает на вход путь до каталога (это может быть и просто корень диска) и выводит общее количество файлов и подкаталогов в нём. Также выведите на экран размер каталога в килобайтах (1 килобайт = 1024 байт).
Важный момент: чтобы посчитать, сколько весит каталог, нужно найти сумму размеров всех вложенных в него файлов. 
Результат работы программы на примере python_basic\Module14:

/Users/ei/desktop/linux/python_basic/module22/module14


E:\PycharmProjects\python_basic\Module14
Размер каталога (в Кб): 8.373046875
Количество подкаталогов: 7
Количество файлов: 15
'''